In [31]:
import numpy as np
import pandas as pd

In [32]:
df=pd.DataFrame({'key1':['a','a','b','b','a'],'key2':['one','two','one','two','one'],'data1':np.random.randn(5),'data2':np.random.randn(5)})

In [33]:
df

      data1     data2 key1 key2
0 -0.082033  0.747576    a  one
1 -0.660992 -1.099575    a  two
2 -0.328740  1.118943    b  one
3 -0.903610 -1.349077    b  two
4 -3.129923  0.153163    a  one

In [34]:
grouped=df['data1'].groupby(df['key1'])

In [35]:
grouped

In [36]:
grouped.mean()

key1
a   -1.290983
b   -0.616175
Name: data1, dtype: float64

In [37]:
means=df['data1'].groupby([df['key1'],df['key2']]).mean()

In [38]:
means

key1  key2
a     one    -1.605978
      two    -0.660992
b     one    -0.328740
      two    -0.903610
Name: data1, dtype: float64

In [39]:
means.unstack()

key2       one       two
key1
a    -1.605978 -0.660992
b    -0.328740 -0.903610

In [40]:
states=np.array(['Ohio','California','California','Ohio','Ohio'])

In [41]:
years=np.array([2005,2005,2006,2005,2006])

In [46]:
df

      data1     data2 key1 key2
0 -0.082033  0.747576    a  one
1 -0.660992 -1.099575    a  two
2 -0.328740  1.118943    b  one
3 -0.903610 -1.349077    b  two
4 -3.129923  0.153163    a  one

In [43]:
df['data1'].groupby([states,years]).mean()

California  2005   -0.660992
            2006   -0.328740
Ohio        2005   -0.492821
            2006   -3.129923
Name: data1, dtype: float64

In [44]:
df.groupby('key1').mean()

         data1     data2
key1
a    -1.290983 -0.066279
b    -0.616175 -0.115067

In [45]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one  -1.605978  0.450369
     two  -0.660992 -1.099575
b    one  -0.328740  1.118943
     two  -0.903610 -1.349077

In [47]:
for name,group in df.groupby('key1'):
    print(name)
    print(group)

a
      data1     data2 key1 key2
0 -0.082033  0.747576    a  one
1 -0.660992 -1.099575    a  two
4 -3.129923  0.153163    a  one
b
     data1     data2 key1 key2
2 -0.32874  1.118943    b  one
3 -0.90361 -1.349077    b  two

In [52]:
for (k1,k2),aaa in df.groupby(['key1','key2']):
    print((k1,k2))
    print(aaa)

('a', 'one')
      data1     data2 key1 key2
0 -0.082033  0.747576    a  one
4 -3.129923  0.153163    a  one
('a', 'two')
      data1     data2 key1 key2
1 -0.660992 -1.099575    a  two
('b', 'one')
     data1     data2 key1 key2
2 -0.32874  1.118943    b  one
('b', 'two')
     data1     data2 key1 key2
3 -0.90361 -1.349077    b  two

In [53]:
print(aaa)

     data1     data2 key1 key2
3 -0.90361 -1.349077    b  two

In [54]:
pececs=dict(list(df.groupby('key1')))

In [55]:
pececs['b']

     data1     data2 key1 key2
2 -0.32874  1.118943    b  one
3 -0.90361 -1.349077    b  two

In [56]:
df.dtypes

data1    float64
data2    float64
key1      object
key2      object
dtype: object

In [58]:
df

      data1     data2 key1 key2
0 -0.082033  0.747576    a  one
1 -0.660992 -1.099575    a  two
2 -0.328740  1.118943    b  one
3 -0.903610 -1.349077    b  two
4 -3.129923  0.153163    a  one

In [59]:
df.groupby(['key1','key2'])[['data2']].mean()

              data2
key1 key2
a    one   0.450369
     two  -1.099575
b    one   1.118943
     two  -1.349077

In [60]:
df.groupby(['key1','key2'])['data2'].mean()

key1  key2
a     one     0.450369
      two    -1.099575
b     one     1.118943
      two    -1.349077
Name: data2, dtype: float64

In [61]:
s_grouped=df.groupby(['key1','key2'])['data2']

In [62]:
s_grouped

In [63]:
s_grouped.mean()

key1  key2
a     one     0.450369
      two    -1.099575
b     one     1.118943
      two    -1.349077
Name: data2, dtype: float64

In [64]:
people=pd.DataFrame(np.random.randn(5,5),columns=['a','b','c','d','e'],index=['Joe','Steve','Wes','Jim','Travis'])

In [65]:
people.iloc[2:3,[1,2]]=np.nan

In [66]:
people

               a         b         c         d         e
Joe    -0.522359 -0.073130  0.239947  0.306744 -0.139363
Steve  -2.398133 -1.537272 -0.766490  0.188521 -0.554948
Wes     1.544948       NaN       NaN  0.260813  0.501920
Jim    -1.651352 -0.061128 -0.511007  0.254163  0.797054
Travis  0.726304 -1.971316  0.187664  0.414297  1.338651

In [67]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue','d': 'blue', 'e': 'red', 'f' : 'orange'}

In [68]:
by_column=people.groupby(mapping,axis=1)

In [69]:
by_column.sum()

            blue       red
Joe     0.546691 -0.734851
Steve  -0.577969 -4.490352
Wes     0.260813  2.046868
Jim    -0.256844 -0.915427
Travis  0.601961  0.093640

In [71]:
map_series=pd.Series(mapping)

In [72]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [73]:
people.groupby(map_series,axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [74]:
people.groupby(len).sum()

          a         b         c         d         e
3 -0.628763 -0.134258 -0.271060  0.821720  1.159611
5 -2.398133 -1.537272 -0.766490  0.188521 -0.554948
6  0.726304 -1.971316  0.187664  0.414297  1.338651

In [75]:
key_list=['one','one','one','two','two']

In [76]:
people.groupby([len,key_list]).min()

              a         b         c         d         e
3 one -0.522359 -0.073130  0.239947  0.260813 -0.139363
  two -1.651352 -0.061128 -0.511007  0.254163  0.797054
5 one -2.398133 -1.537272 -0.766490  0.188521 -0.554948
6 two  0.726304 -1.971316  0.187664  0.414297  1.338651

In [77]:
columns=pd.MultiIndex.from_arrays([['US','US','US','JP','JP'],[1,3,5,1,3]],names=['cty','tenor'])

In [78]:
hier_df=pd.DataFrame(np.random.randn(4,5),columns=columns)

In [79]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -0.445618 -0.311046  2.090729 -0.408594  0.193484
1      0.957311 -1.517590  1.041027  0.720765 -0.338990
2      0.484109 -2.028308  1.288529 -0.240644 -1.157896
3     -0.200518 -0.165474 -1.264318  0.197856  0.274562

In [81]:
hier_df.groupby(level='cty',axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [82]:
df

      data1     data2 key1 key2
0 -0.082033  0.747576    a  one
1 -0.660992 -1.099575    a  two
2 -0.328740  1.118943    b  one
3 -0.903610 -1.349077    b  two
4 -3.129923  0.153163    a  one

In [87]:
grouped=df.groupby('key1')

In [85]:
grouped['data1'].quantile(0.9)

key1
a   -0.197825
b   -0.386227
Name: data1, dtype: float64

In [90]:
def peak_to_peak(arr):
    return arr.max()- arr.min()

In [91]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     3.047891  1.847151
b     0.574870  2.468020

In [92]:
tips=pd.read_csv('/Users/yezhibin/Downloads/书/数据分析书/Notes-on-Python-for-Data-Analysis-2nd-Edition-master/examples/tips.csv')

In [93]:
tips['tip_pct']=tips['tip']/tips['total_bill']

In [94]:
tips[:6]

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808
5       25.29  4.71     No  Sun  Dinner     4  0.186240

In [95]:
grouped=tips.groupby(['day','smoker'])

In [96]:
grouped_pct=grouped['tip_pct']

In [97]:
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [99]:
grouped_pct.agg(['mean','std',peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [100]:
grouped_pct.agg([('foo','mean'),('bar',np.std)])

                  foo       bar
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [101]:
functions=['count','mean','max']

In [102]:
result=grouped['tip_pct','total_bill'].agg(functions)

In [103]:
result

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [104]:
result['tip_pct']

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         57  0.160113  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

In [105]:
ftuples=[('Durchschnitt','mean'),('Abweichung',np.var)]

In [106]:
grouped['tip_pct','total_bill'].agg(ftuples)

                 tip_pct              total_bill
            Durchschnitt Abweichung Durchschnitt  Abweichung
day  smoker
Fri  No         0.151650   0.000791    18.420000   25.596333
     Yes        0.174783   0.002631    16.813333   82.562438
Sat  No         0.158048   0.001581    19.661778   79.908965
     Yes        0.147906   0.003767    21.276667  101.387535
Sun  No         0.160113   0.001793    20.506667   66.099980
     Yes        0.187250   0.023757    24.120000  109.046044
Thur No         0.160298   0.001503    17.113111   59.625081
     Yes        0.163863   0.001551    19.190588   69.808518

In [107]:
grouped.agg({'tip':np.max,'size':'sum'})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [108]:
grouped.agg({'tip_pct':['min','max','mean','std'],'size':'sum'})

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123    9
     Yes     0.103555  0.263480  0.174783  0.051293   31
Sat  No      0.056797  0.291990  0.158048  0.039767  115
     Yes     0.035638  0.325733  0.147906  0.061375  104
Sun  No      0.059447  0.252672  0.160113  0.042347  167
     Yes     0.065660  0.710345  0.187250  0.154134   49
Thur No      0.072961  0.266312  0.160298  0.038774  112
     Yes     0.090014  0.241255  0.163863  0.039389   40

In [110]:
tips.groupby(['day','smoker'],as_index=False).mean()

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863

In [111]:
def top(df,n=5,column='tip_pct'):
    return df.sort_values(by=column)[-n:]

In [112]:
top(tips,n=6)

     total_bill   tip smoker  day    time  size   tip_pct
109       14.31  4.00    Yes  Sat  Dinner     2  0.279525
183       23.17  6.50    Yes  Sun  Dinner     4  0.280535
232       11.61  3.39     No  Sat  Dinner     2  0.291990
67         3.07  1.00    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Yes  Sun  Dinner     2  0.710345

In [113]:
tips.groupby('smoker').apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85     No  Thur   Lunch     2  0.236746
       185       20.69  5.00     No   Sun  Dinner     5  0.241663
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       232       11.61  3.39     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [114]:
frame=pd.DataFrame({'data1':np.random.randn(1000),'data2':np.random.randn(1000)})

In [115]:
quartiles=pd.cut(frame.data1,4)

In [116]:
quartiles[:10]

0      (0.408, 2.119]
1      (0.408, 2.119]
2     (-1.302, 0.408]
3     (-1.302, 0.408]
4     (-1.302, 0.408]
5     (-1.302, 0.408]
6     (-1.302, 0.408]
7    (-3.018, -1.302]
8      (0.408, 2.119]
9     (-1.302, 0.408]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-3.018, -1.302] < (-1.302, 0.408] < (0.408, 2.119] < (2.119, 3.829]]

In [117]:
def get_stats(group):
    return{'min':group.min(),'max':group.max(),'count':group.count(),'mean':group.mean()}

In [118]:
grouped=frame.data2.groupby(quartiles)

In [120]:
grouped.apply(get_stats).unstack()

                  count       max      mean       min
data1
(-3.018, -1.302]   86.0  2.357005 -0.287409 -2.525314
(-1.302, 0.408]   589.0  2.514712 -0.074688 -3.088814
(0.408, 2.119]    310.0  3.008338 -0.069561 -3.057019
(2.119, 3.829]     15.0  1.208254 -0.233952 -1.520651

In [121]:
s=pd.Series(np.random.randn(6))

In [122]:
s[::2]=np.nan

In [123]:
s

0         NaN
1   -1.590244
2         NaN
3   -0.423567
4         NaN
5   -1.256820
dtype: float64

In [124]:
s.fillna(s.mean())

0   -1.090210
1   -1.590244
2   -1.090210
3   -0.423567
4   -1.090210
5   -1.256820
dtype: float64

In [125]:
states=['Ohio','New york','Vermont','Florida','Oregon','Nevada','California','Idaho']

In [126]:
group_key=['East']*4+['west']*4

In [127]:
data=pd.Series(np.random.randn(8),index=states)

In [128]:
data

Ohio          0.610095
New york      1.742085
Vermont      -2.007806
Florida       0.118185
Oregon       -0.151776
Nevada       -0.641466
California    0.223291
Idaho         0.344464
dtype: float64

In [131]:
data[['Vermont','Nevada','Idaho']]=np.nan

In [132]:
data

Ohio          0.610095
New york      1.742085
Vermont            NaN
Florida       0.118185
Oregon       -0.151776
Nevada             NaN
California    0.223291
Idaho              NaN
dtype: float64

In [133]:
data.groupby(group_key).mean()

East    0.823455
west    0.035757
dtype: float64

In [134]:
fill_mean=lambda g:g.fillna(g.mean())

In [135]:
data.groupby(group_key).apply(fill_mean)

Ohio          0.610095
New york      1.742085
Vermont       0.823455
Florida       0.118185
Oregon       -0.151776
Nevada        0.035757
California    0.223291
Idaho         0.035757
dtype: float64

In [138]:
df=pd.DataFrame({'category':['a','a','a','a','b','b','b','b'],'data':np.random.randn(8),'weights':np.random.randn(8)})

In [139]:
df

  category      data   weights
0        a  0.212738  1.912738
1        a -0.472225 -0.953523
2        a  0.683473  0.475596
3        a  1.067857  0.734338
4        b -0.930529  0.236868
5        b -0.998105  1.089908
6        b -1.316176 -1.299100
7        b  1.146736 -0.086112

In [140]:
grouped=df.groupby('category')

In [141]:
tips.pivot_table(index=['day','smoker'])

                 size       tip   tip_pct  total_bill
day  smoker
Fri  No      2.250000  2.812500  0.151650   18.420000
     Yes     2.066667  2.714000  0.174783   16.813333
Sat  No      2.555556  3.102889  0.158048   19.661778
     Yes     2.476190  2.875476  0.147906   21.276667
Sun  No      2.929825  3.167895  0.160113   20.506667
     Yes     2.578947  3.516842  0.187250   24.120000
Thur No      2.488889  2.673778  0.160298   17.113111
     Yes     2.352941  3.030000  0.163863   19.190588

In [142]:
tips.pivot_table(['tip_pct','size'],index=['time','day'],columns='smoker')

                 size             tip_pct
smoker             No       Yes        No       Yes
time   day
Dinner Fri   2.000000  2.222222  0.139622  0.165347
       Sat   2.555556  2.476190  0.158048  0.147906
       Sun   2.929825  2.578947  0.160113  0.187250
       Thur  2.000000       NaN  0.159744       NaN
Lunch  Fri   3.000000  1.833333  0.187735  0.188937
       Thur  2.500000  2.352941  0.160311  0.163863